{
    "Purge the AWS CloudFront cache when update static files.": "静的ファイルのパブリッシュと連動して AWS CloudFront のキャッシュを無効化します。",
    "Distribution ID": "ディストリビューションID",
    "Access Key": "アクセスキー",
    "Secret Access Key": "シークレットアクセスキー",
    "Region": "リージョン",
    "CoudFront's URL" : "CoudFrontのURL",
    "Check Content" : "コンテンツをチェックする",
    "Directry Index" : "ディレクトリ・インデックスファイル名",
    "Purge only Directry" : "ディレクトリのみを無効化",
    "Mappings of path and purge path mapping": "ルート相対パスと無効化リクエスト送信対象パスのマッピング",
    "Exclude URL Map IDs": "除外するURLマップID",
    "Specify comma-separated URL Map Ids for exclude.": "除外するURLマップのIDをカンマ区切りで指定してください。",
    "Purge AWS CloudFront cache": "AWS CloudFrontキャシュの無効化リクエスト送信",
    "Purge AWS CloudFront cache.": "AWS CloudFront キャッシュ無効化リクエストを送信しました。",
    "AWS CloudFront Send Invalidation": "AWS CloudFront キャッシュ無効化",
    "To see the exact number, go to the AWS Management Console." : "正確な数字は AWSマネジメントコンソールで確認してください。",
    "An error occues while purge AWS CloudFront cache.": "AWS CloudFront キャッシュの無効化リクエスト送信中にエラーが発生しました。",
    "Are you sure you want to create invalidation for AWS CloudFront?" : "AWS CloudFrontのキャッシュ無効化リクエストを送信してもよろしいですか?",
    "An error occues while purge AWS CloudFront cache(%s).": "AWS CloudFront キャッシュの無効化リクエスト送信中にエラーが発生しました(%s)。",
    "Monthly cache invalidation requests for this month" : "今月の無効化リクエスト数",
    "The AWS CloudFront cache purge process has been skipped because the configured monthly purge limit has been reached."
      : "AWS CloudFrontのキャッシュ無効化リクエスト送信プロセスは、設定された月間無効化リクエスト送信数制限に達したためスキップされました。",
    "The AWS CloudFront cache purges have reached the set monthly purge limit."
      : "AWS CloudFrontのキャッシュ無効化リクエスト送信プロセスは、設定された月間無効化リクエスト送信数制限に達しています。",
    "The plugin AWS_CloudFront cannot be enabled because the required environment variables have not been specified."
      : "必要な環境変数が指定されていないためプラグイン AWS_CloudFrontを有効化できませんでした。",
    "Cannot be execute because the required environment variables or settings have not been specified." : "必要な環境変数または設定が指定されていないため実行できません。",
    "Specify the root-relative path of the updated file and the cache path to be purged, line by line, separated by commas."
      : "更新されたファイルのルート相対パスと無効化リクエスト送信するパスを1行1セットでカンマ区切りで指定します。",
    "e.g." : "例 :",
    "Triggers" : "無効化のトリガー",
    "Create Invalidation by Specifying a Path" : "パスを指定して無効化",
    "Paths to always purge" : "常に無効化リクエストを送信するパス",
    "Specify the root-relative path of the file that always sends invalidation requests, line by line.": "常に無効化リクエストを送信するパスをルート相対パスで1行に1つ指定します。",
    "Wildcards can be specified." : "ワイルドカードの指定が可能です。",
    "You can specify the waiting time (seconds) before starting execution of the queue by adding a comma-separated number."
      : "カンマ区切りで数値を追加することでキューの実行開始までの待ち時間(秒)を指定できます。",
    "No path specified." : "パスが指定されていません。",
    "No Distribution ID specified." : "ディストリビューションIDが指定されていません。",
    "Create Invalidation" : "無効化リクエスト",
    "Preprocessing" : "前処理",
    "Update" : "ファイル更新時",
    "Delete" : "ファイル削除時",
    "Exclude Patterns" : "除外パターン",
    "Specify the exclude pattern, line by line." : "キャッシュ無効化リクエスト送信の対象外とする更新ファイルのルート相対パスパターンを1行1セットでで指定します。",
    "Use System Setting" : "システム設定を利用",
    "Publish File(s)": "パブリッシュ",
    "Cache Purge(Retry)": "キャッシュ無効化リクエスト送信(リトライ)",
    "Cache Purge(Update)" : "キャッシュ無効化リクエスト送信(更新)",
    "Cache Purge(Delete)" : "キャッシュ無効化リクエスト送信(削除)",
    "(Retry)": "(リトライ)",
    "Upload File": "ファイルアップロード",
    "Upload Files": "ファイルアップロード",
    "Delete Object": "オブジェクトの削除",
    "Delete Objects": "オブジェクトの削除",
    "Save Object": "オブジェクトの更新",
    "Create Object": "オブジェクトの新規作成",
    "Rebuild Files": "再構築",
    "Scheduled Task": "スケジュールされたタスク"
}