{
    "Makes the asset upload function convenient." : "アセットのアップロード画面を拡張します。",
    "Describe the settings for one directory per line(ex. Directory Name : extension, extension, extension)." : "1行につき1ディレクトリの設定を記述します(例: ディレクトリ名 : 拡張子, 拡張子, 拡張子)。",
    "Automatically Switches by file extension" : "ファイルの拡張子によって保存先ディレクトリを振り分ける",
    "Use system settings" : "システム設定を利用する",
    "Enable automatic path switching" : "保存先ディレクトリ振り分けを有効にする",
    "Enable status specification" : "ステータス指定を可能にする",
    "Enable publish date specification" : "公開日指定を可能にする",
    "Enable add Tags" : "タグ付けを可能にする",
    "Use Input Helper for Tags" : "タグの入力補助を利用する",
    "There is no target model." : "対象のモデルがありません。",
    "View Tags" : "タグを表示",
    "Hide Tags" : "タグを隠す",
    "Extract" : "展開する",
    "ZIP file not selected." : "ZIPファイルが選択されていません。",
    "An error occurred while extracting ZIP file." : "ZIPファイルの処理中にエラーが発生しました。",
    "Are you sure you want to extract this ZIP file? (The specified upload path will be ignored.)" : "選択されたZIPファイルを展開してアセットを登録しますか? (指定したアップロード・パスは無視されます)",
    "Enable unpublish date specification" : "公開終了日指定を可能にする",
    "Allow ZIP file extraction" : "ZIPファイルの展開を可能にする",
    "Extract the ZIP file" : "ZIPファイルを展開する",
    "Overwrite files with the same path" : "同じパスのファイルを上書きする",
    "Allow overwriting files with the same path" : "同じパスのファイルの上書きを可能にする",
    "Specify the Deadline" : "公開終了日を指定する",
    "The specified upload path will be ignored." : "指定したアップロード・パスは無視されます",
    "Allow uploading file names containing multi-byte characters as is."
        : "マルチバイト文字を含むファイル名をそのままアップロード可能にする",
    "Don't encode file name" : "ファイル名をエンコードしない",
    "This feature is not available within a modal dialog." : "この機能はモーダル・ダイアログ内では利用できません。",
    "Sync object status and assets status" : "オブジェクトのステータスとアセットのステータスを同期",
    "Assets associated with other objects will only sync if the status of all objects is the same."
        : "他のオブジェクトで利用されている場合、すべてのオブジェクトのステータスが一致した時のみ同期します。",
    "Assets associated with other objects will only sync if the status of all objects is the same, but do not change the status of an assets once it has been published."
        : "他のオブジェクトで利用されている場合、すべてのオブジェクトのステータスが一致した時のみ同期します。一度公開されたアセットのステータスは変更しません。",
    "When an object is published, the status of the asset is set to published, and when it is unpublished, the status of the asset is set to the highest value other than ended among the related objects."
        : "オブジェクトの公開時はアセットのステータスを公開、非公開時は関連オブジェクトのうち終了以外の最も値の大きなステータスにセットします。",
    "When an object is published, the status of the asset is set to published, but do not change the status of an assets once it has been published."
        : "オブジェクトの公開時はアセットのステータスを公開しますが、一度公開されたアセットのステータスは変更しません。",
    "Force synchronization status of publish Object": "オブジェクトの公開時はステータス同期を強制する",
    "Do not change the status of published assets": "公開されたアセットのステータスを変更しない",
    "View Settings" : "設定を表示",
    "Hide Settings" : "設定を隠す",
    "Invalid File extension'%s'." : "この拡張子のファイルアップロードは許可されていません'%s'。",
    "Permission denied'%s'." : "権限がありません'%s'。",
    "The 'id' of workspace." : "スペースの'id'.",
    "Loop out the name and label of the model with the asset field." : "アセットフィールドを持つモデルの名前とラベルをループ出力します。"
}